app/controllers/cuidador_paseadors_controller.rb

SELECT "cuidador_paseadors".* FROM "cuidador_paseadors"
---
  def index
    @cuidador_paseadors = CuidadorPaseador.all

INSERT INTO "cuidador_paseadors" ("foto", "apellido", "nombre", "email", "telefono", "horarios", "rol", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @cuidador_paseador = CuidadorPaseador.new(cuidador_paseador_params)

    respond_to do |format|
      if @cuidador_paseador.save

UPDATE "cuidador_paseadors" SET "horarios" = ?, "rol" = ?, "updated_at" = ? WHERE "cuidador_paseadors"."id" = ?  [["horarios", "Lunes: 9 a 10am\r\nMiercoles: 5 a 6am"], ["rol", "Cuidador"], ["updated_at", "2023-10-31 22:37:39.112099"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @cuidador_paseador.update(cuidador_paseador_params)

DELETE FROM "cuidador_paseadors" WHERE "cuidador_paseadors"."id" = ?  [["id", 1]]
---
  def destroy
    @cuidador_paseador.destroy!

SELECT "cuidador_paseadors".* FROM "cuidador_paseadors" WHERE "cuidador_paseadors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cuidador_paseador
      @cuidador_paseador = CuidadorPaseador.find(params[:id])