app/controllers/perros_perdidos_controller.rb

  def index

    @all_dogs = PerrosPerdido.all
---
SELECT "perros_perdidos".* FROM "perros_perdidos"