app/controllers/perros_perdidos_controller.rb

INSERT INTO "perros_perdidos" ("nombre", "foto", "fecha_de_publicacion", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["nombre", "Napo"], ["foto", "<6 bytes of binary data>"], ["fecha_de_publicacion", nil], ["status", nil], ["created_at", "2023-10-31 20:08:03.432354"], ["updated_at", "2023-10-31 20:08:03.432354"]]
---
  def create
    @perros_perdido = PerrosPerdido.new(perros_perdido_params)
    @perros_perdido.action_type = 'create'
    respond_to do |format|
      if @perros_perdido.save

UPDATE "perros_perdidos" SET "nombre" = ?, "updated_at" = ? WHERE "perros_perdidos"."id" = ?  [["nombre", "Napo 5"], ["updated_at", "2023-10-31 20:35:33.187717"], ["id", 10]]
---
  def update
    @perros_perdido.action_type = 'update'
    respond_to do |format|
      if @perros_perdido.update(perros_perdido_params)

DELETE FROM "perros_perdidos" WHERE "perros_perdidos"."id" = ?  [["id", 3]]
---
  def destroy
    @perros_perdido.destroy!

SELECT "perros_perdidos".* FROM "perros_perdidos" WHERE "perros_perdidos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def marcar_como_encontrado

    @perros_perdido = PerrosPerdido.find(params[:id])

SELECT "perros_perdidos".* FROM "perros_perdidos" WHERE "perros_perdidos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_perros_perdido
      @perros_perdido = PerrosPerdido.find(params[:id])