app/controllers/se_busca_controller.rb

SELECT "perros_perdidos".* FROM "perros_perdidos" WHERE "perros_perdidos"."status" = ?  [["status", "Encontrado"]]
---
  def index
    @lost_dogs = PerrosPerdido.where(status: "Se busca")